#version: 0.2 - Trained by `huggingface/tokenizers`
Ġ Ġ
č Ċ
Ġ čĊ
ĠĠ ĠĠ
ĠĠ Ġ
e r
= =
e t
) ;
ĠĠĠĠ ĠĠĠ
o n
a r
s t
Ġ =
Ġ c
i n
o r
e s
a t
Ġ {
l e
Ġ }
Ġ a
ĠĠĠĠ ĠĠĠĠĠĠĠ
a l
== ==
i t
l et
( '
ĠĠĠĠ Ġ
c t
Ġ '
Ġ t
Ġ r
Ġc on
S t
Ġ n
in g
u b
Ġ let
ar g
at e
st ub
Ġ m
m e
Ġ (
r o
n t
v al
i f
' );
r ing
s s
s e
arg s
r e
Ġt h
w a
d e
a n
' ,
wa it
Ġa wait
u r
e w
s o
r or
Ġ E
n c
u e
ĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠ
so le
Ġcon sole
Ġr et
ar b
R es
g et
ĠĠĠĠ čĊ
Ġn ew
u l
Ġ if
ur n
arb le
s h
e y
q u
Ġ o
a me
p e
) );
ĠĠ čĊ
St ring
l o
w n
==== ====
f er
Ġ ĉ
o l
Ġ args
p er
f o
t o
Ġcon st
i on
r ror
Ġret urn
St ate
wn er
Ġ p
ul t
u t
er y
s y
n d
sy nc
ro w
O N
ĠE rror
Ġ +
Ġth row
Ġ e
Ġ stub
Ġa sync
y t
yt es
val ue
in fo
S ON
J SON
i s
ss et
s on
K ey
u m
a per
] ;
Ġ B
b er
um ber
i st
j son
t r
ult s
( );
ol or
o de
to String
sh i
Ġr es
qu ery
Ġ C
json Res
shi m
u f
Ġo f
ro m
t h
I n
uf fer
N ame
c h
an s
lo g
a ct
a d
Ġ A
Ġ f
Ġm arble
Ġ d
r es
er r
Ġr e
m p
Ġ query
Ġ shim
n g
me nt
st ring
Ġt r
o t
a ss
Ġth is
pe ct
x pect
Ġĉ ĉ
f rom
A s
e d
o d
ng th
le ngth
k e
( )
r i
g e
B ytes
Ġ !
h a
ar se
Ġ jsonRes
t x
O wner
ĠB uffer
Ġ s
ĠĠĠĠ ĠĠĠĠčĊ
if y
Res ults
at ion
string ify
u ment
Ġ b
== =
Ġ arg
Ġ( !
Ġarg ument
er ror
get State
l ass
Ġc tx
Ġc olor
c ode
Ġm et
tr act
at or
# #
h od
Ġa sset
Ġc ar
a m
Ġ} );
re ate
or d
r et
a i
As Bytes
c e
l l
at a
Ġo wner
b ytes
Ġ st
e x
p ut
ct x
er ator
Ġ JSON
o u
y pe
R e
xpect ing
ans fer
m arble
put State
in code
I d
i re
ou nt
Ġ in
at ch
qu ire
Ġmet hod
Ġre quire
Ġargument s
ar am
ct ion
o c
N umber
Ġ i
T r
Ġn umber
Ġe x
on tract
ha incode
ĠĠĠĠ ĠĠĠĠĠ
or re
u n
Ġn ot
orre ct
ar t
( ));
I nc
Ġt o
Inc orrect
p on
es s
c c
ĠE xpecting
Ġp aper
pon se
Ġ get
Ġ 1
(' ========
I D
c ar
ex t
a ke
val bytes
' ;
an ge
k ey
St ub
e nt
C lass
Ġ it
Ġn ame
' )
Ġthis Class
Ġ ========
Ġ In
Ġc atch
ĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
Ġ [
=== ');
c ord
] );
p aper
Ġ= >
u s
a b
i z
le d
i l
ode l
Ġ :
} ;
ll Results
un ction
Ġtr y
Ġ <
i d
Ġ "
o mp
p arse
Q u
i al
Qu ery
cc ess
0 0
Ġm odel
ĠjsonRes p
Ġm ake
Tr ansfer
c n
Ġ======== ===');
let e
n ame
Ġ{ };
l i
g er
a y
o ul
oul d
iz e
P aper
sh ould
Ġb e
u ccess
m ount
M arble
ut il
==== =
A sset
Ġ! =
- -
Ġ 0
b j
V al
e ct
t y
Ġ( )
er s
Ġex ist
('======== =====
Ġp arse
I nt
de x
R ange
lo ad
Re cord
o m
Ġ S
T ype
I t
( {
de lete
u st
Ġquery String
Ġparse Int
ret urn
ĠC haincode
f cn
pe nd
on t
| |
Ġ ||
] .
Ġ h
A R
ut f
an d
B y
s uccess
u sh
it e
Ġf or
L ist
p ush
Ġcar s
Ġ w
F or
A nd
o s
ay load
[ '
c olor
i me
Ġd o
al l
It erator
a se
aram s
v o
Val ue
v e
Ġa mount
Ġdo es
ont ext
ĠB val
a sset
Ġ} ;
on ation
' ));
or y
C omp
Ġĉĉ ĉ
Ġe nd
Ġ! ==
an ce
() )
) ));
ai led
Ġm ust
C ar
ist ory
ĠIn it
F unction
ss u
oc k
ssu er
aram et
it y
And P
c reate
Ġmarble Name
bj ect
r u
aramet ers
Ġres ults
vo ke
Ġth e
ri c
T o
Ġnew Owner
Function AndP
FunctionAndP arameters
e m
ab ric
in on
get FunctionAndParameters
Ġit erator
f abric
mp ty
ĠA val
os ite
it h
u p
) .
Ġ v
F ailed
osite Key
l es
u nd
C ontract
arb les
t e
st a
us er
Ġ} ,
c on
Comp ositeKey
p ro
Ġc reate
ct or
Ġ 2
act ion
Ġc lass
ol d
o f
ans action
om m
H istory
ĠĠĠĠ ĠĠĠĠ
$ {
ad ata
A val
T ime
jsonRes p
st art
( "
b e
Ġ value
Ġa llResults
res ults
Ġ ===
l lo
Ġst art
A llResults
Ġ %
C ontext
(' -
p arams
D ate
i le
Ġpaper Number
M arbles
Ġh old
marble Name
Ġs inon
a p
i c
o k
t ype
oc Type
n o
s et
' ];
Ġ is
" :
Ġst ate
d ate
ĠA valbytes
L o
## ##
u se
er t
B uffer
Ġres ponse
er C
qu al
T AR
n ew
TAR T
Res ult
ai l
ĠS TART
] ,
Ġe xpect
ur re
e qual
Ġend Key
c ial
urre nt
omm er
ommer cial
f or
Ġ 4
o wner
li ent
n umber
( `
l se
In dex
a ge
res ponse
Ġ fo
Ġtr ansfer
Ġ &
c ri
Ġ& &
Ġfo und
N D
Index Key
C olor
Ġe lse
ru g
B val
e n
L ed
Led ger
Ġcar AsBytes
Ġc h
` );
Query Result
ĠE ND
Ġ key
or t
ri ct
O bject
Ġst rict
Name IndexKey
ĠC ontract
al se
ommercial Paper
ĠC ommercialPaper
Ġ -
Ġ 3
As bytes
es cri
Res ponse
de nt
c k
Ġin it
re d
By Range
Ġi ssuer
b ut
c ontract
Ġv ar
Ġp ro
ord er
Ġd ata
r g
Ġ< =
p ort
car Number
m at
up date
ĠĠĠĠ ĠĠčĊ
D ata
. /
) {
n ext
() ));
A valbytes
Ġd escri
Ġ string
: '
Ġf unction
Ġ util
Ġw h
tr i
ar k
or g
llo c
d ocType
W ith
To Transfer
Ġm ock
at us
i g
Ġf alse
all Results
response Range
query String
tri but
Ġ delete
(' ####
Ġ[ ];
m et
return s
Ġcon tract
b o
de e
Ġdescri be
Ġp ayload
i ent
for mat
Ġ user
Lo w
u y
Ġasset Transfer
al ance
to Low
erC ase
toLow erCase
a s
tr ue
" ,
m ark
Ġe mpty
s er
P ro
car AsBytes
ed Marble
('#### #
Ġmarble JSON
delete State
con st
ok mark
Ġ ${
le ctor
Ġ at
type of
Ġmet adata
Ġd onation
Date Time
ĠIn voke
sta nt
on e
Ġch ange
Ġ Record
se lector
Ġ de
Ġĉ čĊ
tribut es
paper List
Query String
e l
al led
A d
S P
tr ansaction
Ġ' ,
Ġc c
an y
S pend
======== ========
Ġs pend
Ġ json
i ate
create CompositeKey
l a
e nd
Ġat tributes
get AllResults
Ġwh ile
se d
st ance
T h
O R
p ayload
stant iate
E rror
ss ue
Ġn on
') .
v i
dent ity
e mpty
History For
r d
C haincode
dex Name
ĠĠĠĠ ĠĠĠĠĠĠĠĠĠ
re ad
sta mp
met hod
Ġc haincode
" );
q ue
Ġex te
In stance
Car Owner
Ġtr ue
ĠC reate
Ġexte nd
or k
Ġextend s
A rg
v ent
p p
color NameIndexKey
g ist
For QueryString
QueryResult ForQueryString
Ġchange CarOwner
u le
l er
te ger
and ler
Ġin teger
T x
C AR
Arg s
Ġi d
getState ByRange
le ction
ial ize
S ize
d u
Ġhold er
que st
m ock
I dentity
nc e
d ata
) )
de em
E xpecting
Ġhold ing
per ty
c alled
a g
Ġquery Results
h ar
U ser
A ll
ĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
st atus
B valbytes
Ġ Ledger
D e
Ġstart Key
lo se
Ġt ype
a wait
ĠC ar
start Key
ĠInit ialize
() .
D onation
lient Identity
o okmark
Ġresults Iterator
d one
ai sed
r aised
O n
raised Value
Ġo bject
s p
transaction Context
i r
Ġc urrent
od ule
M et
a sync
9 9
du ct
ap i
mp le
c lose
j ect
j s
Ġ ha
p t
Ġ error
i v
i ssuer
F rom
ist s
Ġtr ans
le nt
Ġs ize
-- --
port s
Ġget AllResults
marble AsBytes
( [
E x
l y
read y
Ġres ult
Ġa l
lent h
Ġobject Type
ass ert
pp raisedValue
Ġm odule
' ]
ex ports
P e
results Iterator
bo x
s g
and box
: %
O f
n et
A lloc
Ġal ready
Ġa nd
Ġ order
at ient
R E
Ġĉĉ čĊ
Met adata
Ġexist s
Ġ ID
In it
B ase
P ri
Ġp arams
ab le
d On
s pend
ru ctor
Base dOn
on or
BasedOn Color
Marbles BasedOnColor
C O
Ġ un
dee p
Ġtransfer MarblesBasedOnColor
omp any
Ġre deem
Ġtransfer Marble
edMarble Name
res ol
C all
Ġs andbox
(' #
(` ${
Ġĉĉĉ ĉ
(' ./
e ck
Ġmarble ToTransfer
Ġw ith
A mount
it erator
ce iv
Ġ 5
R N
me d
O bj
ch a
in ation
Ġcar Number
Ġb uy
Ġ se
ess age
p ment
Ġre cord
ll er
D E
de d
Ġd rug
1 00
S E
Ġquery All
u nc
C h
+ +
l ist
Alloc ation
S h
Ġcurrent Owner
Ġ per
2 0
Ġf cn
val Asbytes
ĠĠĠĠ ĠĠĠĠĠĠĠĠčĊ
Th e
in it
N G
In fo
Ġs u
log ger
Ġconst ructor
so me
In voke
B alance
d onation
cha incode
R R
Tr ansaction
Ġi ssue
G et
Ġreturn ed
P ag
ir st
RR OR
With Pag
WithPag ination
set Owner
m ake
C reate
} ,
Ġf rom
ĠA sset
Ġmock Stub
Ġ P
M sg
up p
con sole
am ount
har m
a ve
k no
et ail
on ey
. ./
Results Iterator
kno wn
ad ing
a mple
Ġ _
Ġ[ ]
Ġquery Marbles
age Size
Ġchaincode Stub
CO DE
Ġde code
* *
Ġp ageSize
H andler
Ġb ookmark
O K
(' \
o ve
ĠC ontext
th row
create Stub
. _
cc ount
De lete
Ex ists
P ayload
in e
Ġis History
dee med
Ġ1 0
Ġsu per
ime stamp
ON SE
SP ONSE
RE SPONSE
Ġper son
Re ceiv
createStub Instance
Ġ update
ke n
N o
Create Asset
O rd
make Key
e st
M SP
Ġ on
Ġd ocType
stantiate d
Ġquery By
++ )
O nce
called Once
ha i
o in
as Bytes
HistoryFor Key
F unc
-- -
r y
tr ansfer
==== ===');
v es
Ġ Key
and le
in dexName
Ġtype of
w ork
Ġin dexName
er Id
oc ation
pro to
Ġex ample
================ ========
ge n
NG O
ĠIn stantiated
al let
('======== ========================
Ġa lloc
('================================ =======');
Ġget HistoryFor
) ,
an n
Ġ F
Ġthis Object
v er
ĠAsset Transfer
Ġun known
Receiv ed
" }
Ġcolor NameIndexKey
to Buffer
llo w
marble ToTransfer
{ "
d rug
A t
res s
ad d
li ce
From Contract
Ġresponse Payload
ĠB valbytes
vi ce
gist r
ot al
ĠgetHistoryFor Marble
Ord er
Ġcolor edMarble
ĠcoloredMarble ResultsIterator
ĠmarbleJSON asBytes
Ġreturned Color
Ġreturn edMarbleName
ĠĠĠĠ ĠĠ
Time stamp
Tx ID
P art
get QueryResultForQueryString
Ġget QueryResultForQueryString
Ġ Response
ch ai
v ocation
('======== ===
l ue
erC RN
fer red
Ġin vocation
p harm
resol ves
Ġ======== =
er ial
Ġinit Ledger
" )
in d
Ġs uccess
ĠE RROR
Ġalloc ate
ul l
C urrent
at h
Ġ========= ');
Pe er
org an
Ġw ork
b lue
('======== =
r ad
Ġ1 00
Ġa d
T E
a x
s inon
a ce
li b
: ');
y e
l it
Ġha s
Ġtrans a
val id
gist er
M ap
ol lection
Ad ded
v ate
Ġ ==
-- >
. .
D onor
} );
at es
Ġtransa ferred
b alance
U p
res ult
Ġallocate Spend
a v
} `);
get QueryResult
Ġv ot
E vent
S upp
w h
ation s
Ġ ('
] )));
" ;
gistr ation
Ġ< -->
C ount
th is
t er
Ġo wn
Part ial
Ġtr ansaction
D rug
F i
Ġ Re
Ġre ad
get Owner
al lo
etail s
an a
shi pment
I ssue
Ġ M
or e
g re
ri ce
get Paper
re cord
m y
P ass
c ount
t imestamp
Ġb uffer
2 2
Lo g
By Partial
f ile
Ġpaper Key
paper Key
Ġmarble Asbytes
marble Asbytes
ig n
at ur
sp lit
update Paper
b uy
Th is
Ġ Owner
M i
00 00
T om
an g
at ing
c ess
ByPartial CompositeKey
Ġc hai
(' ../
getState ByPartialCompositeKey
as k
Issue d
O rg
Car s
ar i
nt ity
ng o
Ġ Paper
net work
car s
ĠCommercialPaper Contract
irst Call
ch eck
ok o
ave l
de n
Ġm y
() ,
ing Owner
Tom oko
c omp
Ġissue DateTime
u nt
Marbles ByRange
ace Value
ĠF ab
Ġad d
o o
Tr ading
Ġm atur
ity DateTime
la ck
Ġmatur ityDateTime
Ġget MarblesByRange
a c
s ize
mock Stub
Re deemed
b lack
99 9
Ġredeem ingOwner
Ġf aceValue
ĠPaper List
proto type
ĠCommercialPaper Context
ye llow
i a
get TxID
Asset s
Ġ .
e e
p ur
Ġ' _
o ur
gre en
S e
tr y
o b
Ġt otal
Pro perty
ĠFab Car
re ject
ch el
ot ar
M ax
Ġpro duct
pt ion
Ġm oney
wh ite
get HistoryForKey
Ġget Error
ĠgetError Response
st ates
ri ana
B rad
J in
ĠS oo
Ad riana
init Func
Mi chel
ann el
Donation s
T est
ĠC olor
V ot
in a
if ic
Ġquery Car
ĠA ppraisedValue
A ppraisedValue
er vice
Up date
ĠS ize
Ġc ompany
c ompany
Ġr s
ch ase
and id
k s
List en
And Listen
Peer AndListen
ask PeerAndListen
Ġ >
p le
Ġt x
if i
Comp any
ĠqueryAll Cars
R o
i ce
ĠqueryBy String
rom i
et ch
Ġcreate Car
( (
an o
c ation
u c
H y
Ġp atient
N ext
r Value
Ġ Date
B ar
b ro
called With
y ot
Re quest
To yot
20 5
Toyot a
er ia
M ust
Ġmarble AsBytes
Must ang
Val eria
und ai
Hy undai
F ord
otar o
f in
Sh otaro
V ol
es la
pur ple
ks wa
T esla
ar av
Ġha ve
Vol kswa
Volkswa gen
A arav
N ano
P ari
T ata
o let
u ge
ol den
ig o
vi olet
Pe uge
ind igo
Fi at
Pass at
Peuge ot
H olden
P unt
T uc
ch em
Ch ery
Punt o
Tuc son
v ot
Bar ina
bro wn
a ch
Pri us
Ġm ove
pro perty
Ġre quest
Ġa n
Ġb y
f irstCall
ĉ ĉ
Ġcon t
Ġin voke
Ġ g
' :
0 1
e xpect
Ġc lient
N T
bo okmark
i m
create Instance
( ()
Ġn um
f etch
in voke
a in
Ġresponse Range
M A
c atch
ur chase
andid ate
A lice
ar ch
Tx Id
Ad d
Chaincode FromContract
Ġin dex
U t
Re gistration
Ut il
[ "
Ġ );
I s
ail able
Ġp rice
Ġn ull
Ġb atch
fetch ed
p atient
' ]);
0 2
get Args
Ġin stantiate
c lientIdentity
s Count
record s
Pri vate
Ġh istory
i es
Ġ' {"
re a
get Current
Ġ ];
f ee
split CompositeKey
Is Delete
Ġbuy er
Ġc id
ub li
Ġ' );
m essage
Sh i
A C
th e
( _
allo t
g o
ĠC lientIdentity
pro duct
Ġupdate d
is History
pharm a
C lientIdentity
u id
Ġh andle
u re
Ġse ller
Ġ ar
Ġp urchase
Ġto ken
For NGO
ĠB ookmark
ĠRecord sCount
e vent
Response Metadata
oin t
an uf
anuf act
donation Id
MSP ID
Ġnum er
ert ific
By Owner
) ');
chaincode Stub
Ġ( {
Ġ ---
v ailable
Ġe vent
f i
Ġm arbles
Ġcreate Context
resol ve
f a
lo cation
J son
Ġ Failed
E ach
transfer Marble
Ġcreate CompositeKey
Ġdrug Name
Ġ or
Util s
(' ---
Ġspend Allocation
Add ress
Ġnumer ic
wa nce
marble JSON
Registration Number
c lient
m ail
of fee
w ith
Tr ans
Ġa ss
fa ult
Ġ log
Ġpro perty
Transfer red
It em
h t
Ġ logger
Delete Asset
Ġ should
new Owner
return edMarbleName
C ode
E R
get ID
el per
U n
r ay
Ġ Marbles
: \
m ove
Ġread Marble
D etails
Ġ Handler
Ġmarble State
marble State
Ġinit Marble
spend Allocation
e q
ertific ate
Ġuser name
st ore
Ġn o
": "
Ġf ab
er ate
port er
re quest
Ġc all
se ller
ad Asset
---- ----
u g
Ġ list
vo ice
Supp ly
u dent
h andle
c all
S ervice
Ġ err
ngo RegistrationNumber
** **
Ġass ert
Ġn go
Ġe lection
for e
I ssuer
ĠĠ ĠčĊ
ha s
an et
T I
For Donor
A r
ĠqueryMarbles ByOwner
Ġ organ
st em
askPeerAndListen Stub
Ġ shipment
a sh
i p
100 0
it al
ex ists
Ġ `
Ġa s
pro v
. ')
Ro le
In stantiate
S end
with Args
Ġown ed
C ollection
Ġ D
Ġst rValue
eq l
Log ger
Ġc ase
Ġwh en
Spend Map
OR MA
buy er
Ġa ccount
ĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠ
Ġch eck
it le
Ġst atus
d onor
M e
Ġp ass
Pro duct
Ġ valAsbytes
reject ed
Ġ[ '
mple ment
Ġasset JSON
chem a
Ġc omp
ĠC urrent
( /
paper net
h ic
Ġs erial
a ntity
ng ine
Shi pment
Ġh andler
romi se
getCurrent State
ate d
] ).
o ut
ur er
Update Asset
! !
L E
is ation
f ail
hic le
C A
Ġ{ "
Ġexpect ed
P er
Ġbe fore
Transfer Asset
St atus
Ġ--- ')
d At
h andler
. ');
get MSPID
in dex
shi p
" ]
Ġf ailed
iz ation
i ew
sp Id
Ġmarble name
nd er
f ul
Ġ l
100 1
Ġquery Spend
mplement ations
tr ans
Ġa ll
os er
fin ed
1 1
m it
Supp li
C ont
T A
g ing
W allet
Val id
is Issued
Amount ForDonor
a ck
re ator
anufact urer
ha ve
m oney
p os
ut h
C lient
C offee
c ommercial
commercial paper
c urrent
Ġ T
I mplementations
set Event
c ontext
ad har
Call ing
Ġ Get
Private Data
ubli c
Ġre gister
per t
met adata
add Paper
pro cess
b uffer
set Issued
Ġ Stub
get Issuer
pert ies
Ġre deemed
set Trading
able Item
Ġm essage
Ġtr ading
our se
Ġpurchase DateTime
l ate
Re deem
de fined
Ġb alance
ap p
Ġredeem DateTime
_ _
a N
b atch
u uid
or ange
paper list
Ġĉĉĉĉ ĉ
rea k
isation Role
c om
r a
a ccount
pharm anet
Redeem ing
set Redeemed
M essage
R ating
re am
w ord
is Trading
is Redeemed
ĠqueryBy Key
To ken
/ );
e ig
n Calling
invoke Func
ve hicle
H elper
C RN
f alse
m odel
I N
S erial
pe n
5 0
p ha
is N
"} }
ĠĠĠĠĠĠ ĠčĊ
Ġfab car
to t
i ve
expect ed
ĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
Ġhas Next
Suppli ed
Ġtr avel
Ġb reak
isN aN
S p
c i
n ot
w r
p ath
order Id
rejected With
Ġdonation SpendMap
ĠCar Number
ry pt
o p
Ġf und
Ġd ate
red it
in ue
ĠC AR
Ġs et
f ter
tot al
Ġ N
I S
Ġin s
A L
M y
d o
qu antity
ust om
ful ly
"}} ';
._ _
Ar ray
Ġar e
e lection
s ForNGO
Ġ R
c omm
ĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠčĊ
i ss
Ġ valid
p art
F ile
led ger
R ON
getStateByRange WithPagination
re gister
Asset Id
ifi ed
stem Contract
L e
Ġa vailable
Ġcont inue
F ORMA
W RON
FORMA T
WRON G
update d
s F
(' {"
Ġe n
A ccount
} `
Ġt imestamp
__ ('
m t
Ġth at
tribut e
m in
1 0
H ash
Ġ1 5
l d
Query Iterator
annel ID
c ert
In valid
ĠChaincode FromContract
all y
Chaincode Stub
ifi er
s ub
Ġquery HistoryForKey
Ġpro file
call sF
callsF ake
st r
= >
Ġ Utils
m ap
Ġf irst
m b
ri vate
proto s
in k
gen erate
B atch
1 2
C o
Ġ Object
st ate
Ġa fter
em ail
"} '));
Of Donations
\ '
Ġ load
ustom er
Ġf i
ĠA B
S TE
#### ##
Ġ3 00
Asset Exists
100 3
ublic Key
###### #
Ġ Valid
Ġ+ =
Ġ sy
C hai
Ġa ccess
Ġt itle
os p
per ation
llo wance
Ġ' ';
Ġtrans ient
.. .
E RROR
mp l
ann ot
ĠAB store
user Id
osp ital
ed ic
on ent
S Y
em ber
Ch annelID
f unction
All Assets
Ġw allet
wr ite
Ġ2 00
STE M
SY STEM
Ġit em
Get State
O wn
T R
h istory
on g
) ).
p pro
ers ion
Ġe nt
Pri ce
mb ol
ĠValid ations
Alloc ated
c ollection
val AsBytes
c a
Ġc andidate
Ġ100 3
d s
oin s
V er
Ġasset s
Ġvot er
Own Property
Ġnumber OfDonations
Ġamount Allocated
To Donation
ser ial
spend Amount
Ġ5 00
ĠamountAllocated ToDonation
p o
asset ID
Pro to
E T
i er
Ġ Order
-------- --
ier arch
Ġ' +
drug Name
total Supply
ist ri
ĠRe adAsset
reject s
se c
Ġ TransferAsset
Ġe mail
Ġv er
ierarch y
Ġ y
ĠCreate Asset
Ġbatch Coffee
lo w
key s
Ġcreate d
At tribute
Ġfund s
P E
id er
fi x
Ġbefore Each
ou nd
comp oser
romi sed
Attribute Value
Ġde fault
User Name
Ġ G
P ath
c ont
u ally
Ġ User
Ġc ert
Tr avel
Ġuser AsBytes
event ually
oint s
i ll
ĠP romise
Se c
N ew
iz ed
istri but
ay ment
Ġm atch
Ġ Query
et work
ĠĠĠĠĠĠĠĠ ĠĠ
Ġhistory Record
Ġch annel
iss ion
re fix
3 4
e mp
m art
ĠqueryMarbles WithPagination
ĠgetMarblesByRange WithPagination
th en
uy er
My Asset
C omm
eig ht
N O
c andidate
ve l
ass ign
a nt
ig in
in t
Ġ DeleteAsset
Transaction s
Ġ100 1
prov ed
} },
Ġ j
Ġc p
v ery
Ġa pp
S y
o bj
w allet
Ġ )
me m
u es
Ġ L
Ġ4 00
add ress
E ntity
contract s
Ġserial No
d es
p ass
Ġ location
Ġdonation Id
B g
M spId
T Y
ĠĠĠĠĠĠĠĠ ĠĠĠĠ
la st
Ġbuy erCRN
Ġins ert
ance Co
Ġĉĉĉ čĊ
Ġpro cess
E C
E NT
I mpl
Ġre ject
Ġv iew
Ġmoney Bytes
ĠquerySpend Allocation
Ġ2 0
mem ber
5 6
z z
us ers
- '
ol l
Ġb allot
ai d
Ġun defined
B A
E ngine
Ġs ub
ry p
donor UserName
am es
p ic
s Sec
od ity
user AsBytes
Ġuser Id
chem as
Trans ient
allo wance
c p
Ġ X
in s
la ce
uth or
istribut or
V an
an k
Ġp ath
buy erCRN
_ '
Ġc omm
llow ed
C alled
the ChannelID
Ġent ry
B ob
st rValue
equal s
Ġmock ClientIdentity
not Called
R O
a ug
ist ic
port erCRN
Ġp o
is ion
Ġres ol
ment Metadata
From Code
aug mentMetadata
augmentMetadata FromCode
Ġ UpdateAsset
Ġ{ }
CO U
Ġ(! (
00 0
Time Obj
)) )
E X
U s
Ġa ppraisedValue
ship per
organ isationRole
Ġmy Contract
P atient
Ġ q
C on
in st
Per Donation
index Of
a cc
f ailed
g h
Ġc an
un ity
const ructor
arch Key
i ed
Vot er
de b
vi ew
onent s
Ġ Test
Sp y
ierarchy Key
M ock
Ġinsert ing
Ġo bj
Re g
: "
Chaincode Impl
upp li
I P
Ġre ceiv
rea son
P arse
Ġ W
Re adAsset
COU NT
Ġs chema
AC COUNT
' },
a de
f g
lo at
pos al
lo ck
Ġvot ableItem
Ġ H
Ġ Id
Ġcreate Donation
A mt
Ġ quantity
sh ed
pe er
Ch eck
Ġ so
li very
a le
m ission
ro y
Ġs ervice
D A
()) .
e c
Ġ" %
ĠĠ ĉĉ
ur ce
n se
nc rypt
M E
b al
Ġ" '
get Call
7 5
B uyer
pro perties
"} ';
Cont ent
do ctor
Ġ Pro
ĠInit Ledger
C har
Ġf in
Ġtrans porter
Q ue
g ain
lo bal
State QueryIterator
CA l
sec ure
1 6
v ar
Ġa adhar
Ġpro ject
Ġse nder
T OR
p rice
Ġ' "}}';
re gistration
ĠChaincode Stub
has Next
le ct
Ġv ersion
" ){
E nt
F ound
St ream
Ġexist ing
mock Handler
CAl pha
A B
F I
] ]);
t ime
per ator
ret ail
t a
Ġ info
Ġret ail
ite m
Ġspend AmountForDonor
Ġspend Amt
+ '
Response Range
M ar
] ));
d etails
bo se
vot er
ain er
e lse
Ġc op
to ken
Ġ uuid
fer e
ser ver
pt s
check Supplied
checkSupplied Stub
ur r
Ġorder Id
spend Id
P oints
Ġ vehicle
Ġmock ery
../ ../
( ['
Ġm sg
de fault
P a
Peer Address
Ġ NGO
contract Implementations
el d
Ġcop ied
S TA
Ġ use
ar d
Ġadd ress
ob ile
Un it
p c
Ġp rivate
Ġin voice
of it
Ġdata Buffer
Ġsy stemContract
( !
E mail
H old
act ly
Ġcontract Instance
Pa ul
ter n
Ġtransaction s
Ġpass word
ryp to
A ccess
e al
ur l
Ex actly
T roy
p ink
Of Assets
ĠN ode
P ublicKey
o bject
le ment
Ver bose
A w
N V
Ġm edic
pro file
peration Id
C ON
e ng
Of fer
Ġ This
re store
get Metadata
be en
Context Id
mock ChaincodeImpl
getQueryResult WithPagination
} )
nc y
ce pt
Ġd onor
have OwnProperty
TY PE
te st
con ds
Get QueryResult
im al
Bg NV
it ing
Ġm ember
Ġquery Donor
ubli sh
fere nce
r pc
Ġc ollection
ol ic
Ġex p
il ity
util s
ĠS h
'] ['
ĠM y
Ġ *
gain st
f il
Ġrequire d
pro ject
' ],
b allot
p h
le ase
Ġs pe
Ġsuccess fully
Ġcompany Name
f ake
is Verbose
iz ers
med ic
' t
o me
ar n
Contract Implementations
mock Iterator
resolve ContractImplementations
f ic
Ġc ertificate
olic y
] )
Ġr o
St art
ĠA d
iz er
Ġ" ,
Ġmock PeerAddress
Pro ject
Ent er
O G
h ex
le ar
Ġorder AsBytes
udent Id
GetState ByRange
g net
n ull
the TxID
inst on
Ġso urce
a w
Ġ Number
Ġ generate
ĠS pend
Ġdo ctor
Ġdonation Map
Ġspend Amount
Ġspend PerDonation
Serial ization
Ġdefault Serialization
P refix
l ab
Ġpass ed
ĠGet AllAssets
Ġt sSec
ig ital
Ġlog ging
D etail
h old
m sg
Ġjson Record
Ġse ll
E nd
Ġ' $
M od
Ġde st
er g
Ġd one
To Send
ĠĠĠĠĠĠĠĠ ĠĠčĊ
With Exactly
calledOnce WithExactly
deb ug
uppli er
V iew
Ġ ?
Ġp ay
Ġa ction
Ġt ime
1 9
Ġ lo
or m
sh all
Ġp art
Ġf ile
unc AndP
list ing
d i
led ge
o pen
Ġt emp
ber t
oc ument
C reator
t ag
Ġ} ).
ve st
Ġ' .
Lo ad
pos it
F loat
Ġc ourse
tr avel
Rating sForNGO
" ];
S CAlpha
uf fic
ou gh
Data Buffer
Send er
in ess
With QueryString
check A
TI ON
uffic ient
ate nt
eal th
S ign
b t
Ġ /
Ġc orrect
Ġtransaction Context
Vot able
**** ****
h er
us iness
Ġ- =
E lection
P ort
get Transient
({ },
vo k
order AsBytes
Ġcontract Id
etail er
N etwork
Ġdrug Key
tern al
P late
l ine
ar y
Ġc i
Ġof fer
Mar shall
: :
get AttributeValue
Ġregister ed
\ -
l and
in voice
Asset Info
ec ut
Ġ' ',
ot str
un secure
Ġde c
Ġen ough
otstr ap
S A
Ġ Drug
Ġc ount
ĠR ule
c id
Ġ val
Ġ ...
ar m
let ed
Ġpro perties
ĠvotableItem s
N ET
in c
imal s
3 0
T ext
Ġa llowed
li cation
comp onents
Se ller
Supplied Metadata
gainst SuppliedMetadata
checkA gainstSuppliedMetadata
. `);
g rad
ad min
ex p
register Mock
usiness Network
Ġ one
ar e
Ġt map
Ġr ew
escri ption
ins pect
E Y
u ction
tr s
create dAt
Ġt est
St udent
Ġĉĉ ĠĠĠĠĠĠĠ
Ġdonation sForNGO
mock Stream
iv ity
Ġtrans porterCRN
fin anceCo
Ġevent Reg
l u
comp ile
P O
U G
Ġ ####
Ġa es
Ġp ut
ic ip
on th
Ġc re
Ġbe en
sp id
batch Id
C ase
S S
` ;
j v
ing A
('#### #######
20 20
Ġlist ing
####### ');
Ġ#### #######');
b id
f ir
st ream
Ġa ppro
Ġa uthor
de c
Ġorgan isationRole
Ġafter Each
w d
of fer
Ġsinon Chai
Ġdescri ption
Current Balance
sinon Chai
Donations ForNGO
ĠTest Context
igital Asset
N ode
p s
s c
ri e
ĠS y
my AssetId
ĠT otal
P romised
Y ou
d it
ĠĠ ĉ
Ġa ge
Ġa llowance
Ġp ag
ad er
As Promised
({ });
Ġinit ial
ĠqueryAll Spend
my AssetExists
ĠquerySpendAllocation For
i b
Ġ ledger
asset Exists
Ġcreate Spend
Ġcreate Rating
owner Id
Org an
Ġor igin
N um
h y
n ode
Ġ ,
res cri
Ġmy AssetId
Trans porter
Ġtimestamp String
erg y
Ġc o
um my
Ġresult AsBytes
Init Ledger
' }
C ertificate
', '
As Json
Ro bert
Ġg ot
" ));
Ġ org
h ing
Tx Timestamp
app raisedValue
9 8
S chemas
c ertificate
f lect
Ġd etails
asset Id
ĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
client Id
compile Schemas
N ot
de code
a mp
er o
Ġtotal Supply
patient Id
A llowance
s ave
Ġ up
ch annel
Ġ> =
trans porter
ĠC annot
Re gister
ic es
Ġl and
GetQueryResult WithPagination
0 9
A N
C D
get M
ot ation
Ġcontract AsBytes
ye ar
our ce
vot erId
rescri ption
p proved
i ation
Ġ le
it ize
se archKey
Ġs ign
Ġcreate Donor
for m
cept ed
' +
1 5
i ator
v ider
Ġ ----------
Ġc redit
ĠB o
Ġw r
'] ).
.. ');
ific ation
company ID
Ġ---------- ');
L oc
] :
Ġ Donation
Ġ} )
Ġcreate NGO
im PublicKey
oint ment
4 8
T otal
ro le
ss v
Ġin put
50 9
' .
A vailable
Ġc ustomer
al ity
ing Id
Ġf s
ab li
ac ient
Un known
CON TR
abli shed
T C
m anufacturer
p lace
or ld
', [
Ġb id
Ġasset ID
') ,
Contract or
Ġdonation s
h r
s AsBytes
P RO
i pment
get PrivateData
log ging
Ġtx id
ack age
part ment
C OR
p ay
r ating
ĠĠĠĠ ĠčĊ
asset s
ternal GetStateByRange
se nder
Ġparse Float
con stant
lice nse
Ġlist OfAssets
last Name
Ġ sh
ĠB ut
Ġi dent
Ġ" ";
Chaincode Message
getCurrent User
Enter ing
, "
F und
n s
s um
') {
('../ ../../
prov ider
F n
g rpc
v info
Ġm anufacturer
re quire
Ġe ncrypt
read Asset
Ġfab protos
Le vel
Ġver ify
ĠL OG
\- \-
hy per
CONTR AC
. ",
C oins
g ed
re q
ha in
Ġi dentity
Ġmock Response
Ġtotal Spend
Ġtotal Donations
spendAllocation Amount
comm unity
Ġavailable AmountForDonor
U E
Ġ Q
contract AsBytes
++ ;
hyper ledger
B usinessNetwork
M odel
i dentity
Ġ Vot
Ġe lement
and om
ĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠ
Of Iterator
romise OfIterator
9 7
e ver
m s
Ġe m
Ġhistory Iterator
Ġident ified
CONTRAC TOR
M C
o i
Ġ Data
Ġc rypto
Ġ( (
so met
Ġf ind
cc es
li e
ORMA L
NO T
Char lie
uncAndP arams
somet hing
N ORMAL
R etailer
] ['
m od
user name
Ġha sh
ra w
AB NORMAL
cces fully
. '
c ol
o ption
s chema
Ġ \'
ap pro
Ġcont ent
icip ant
c redit
tx ContextId
gistr ar
Ġtx Timestamp
F irstCall
P ayment
on FirstCall
As B
asset AsBytes
Ġĉĉĉĉ ĉĉ
h oc
n er
Ġs ave
Ġuser Key
M R
S uccess
Ġ Product
St amp
Ġasset Info
Ġparse d
asset JSON
Ġmock Iterator
", "
drug Key
Ġcompany CRN
pass word
Ġreceiv er
1 3
D V
b le
w inston
on s
at ure
create Context
cha in
Count er
expected Msg
ĠSy stemContract
Y e
c reator
Ġb ytes
put PrivateData
Ġ" );
sp ID
metadata ToSend
Ġresol ve
j oin
p romised
Ġp h
ist ing
Ġdata TimeObj
From Batch
irst Name
Pass eng
Assets FromBatch
=> {
get TxTimestamp
un defined
') ).
Ġkey s
Pro cess
Ġjson QueryString
Ġserial izers
ĠG en
Ġcomm odity
acc ine
7 8
p rivate
Ġc annot
Ġ' -'
ig h
Ġcontract s
Ġspend er
history Record
serial No
f s
t ext
u ck
Ġr b
Ġn ames
ha ir
asset Name
ĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠčĊ
ap proved
contract Id
process Contract
1 8
i ssue
le vel
re gnet
ch o
Ġf ake
no w
eig th
}` ;
sub ject
p re
ge st
ser vice
data TimeObj
C fg
n on
q Handler
Ġ 6
Ġ J
Ġc alled
zz zz
G V
S andbox
c ourse
e p
i dent
se ll
Ġst ock
Ġw eight
user Key
Ġdata Collection
arm er
ur ance
Ġasset Buffer
Asset State
ĠP L
est ablished
ci ever
inc lu
M B
h ierarchyKey
ro ller
retail er
hair s
inclu des
9 0
B allot
M ark
a st
s lice
es ize
Ġs ufficient
ver ify
Ġlog istic
ht t
Ġexpected Msg
}` ,
Ġballot Data
F in
Ġ" +
([ ]);
Company Name
2 8
E D
Ġ ]
Ġ Property
ire dAt
For Owner
Ġresult Obj
Ġproduct ID
vot able
3 3
A uth
} }
Ġ O
or igin
query WithQueryString
Ġs upplier
Ġ--- ');
Ar r
ĠBo otstrap
L S
i mple
o perationId
Ġ peer
ex ample
donation Amount
i de
Ġ U
at ic
ĠS mart
cri pt
Ġse nd
Ġbuffer ed
Serial izer
' });
h s
Ġ Log
wh ile
Shi p
BgNV BA
Register ed
2 56
S G
u red
al pha
ĠC lient
Ġasset Name
Ġasset Id
Ġin vok
Ġuser id
our s
!! !
R et
h ospital
Ġ =====
Ġc reator
Ġm od
Ġo pts
Ġasset Key
') )
Ġfor mat
---- -
Get AllResults
ver ifier
TE D
Ġvot e
Company CRN
Proto type
Ġq Handler
urr Election
Ġlogging Service
Ġaes js
Auth Value
D O
D o
H O
M at
v ision
de partment
sy mbol
ĠS u
ru ct
History QueryIterator
sp y
Vot e
Ye ar
\ "
] ))
Ġ selector
check MspId
Ġtx Helper
STA NT
Ġspe nt
Ġem r
T H
w er
Ġc oins
Ġ+ '
Time Stamp
Ġmock Handler
ig ht
Ġdrug Object
Ġg lobal
Ġbatch Id
save AssetState
% =
C ert
P end
v Org
Ġ Transfer
Ġc age
Ġb ut
Ġ% >
Ġhold Obj
for Each
Ġdata Service
Ġcontract AsJson
Balance Of
donation SpendMap
Ġalloc ation
Ġtotal Available
Ġar ray
ĠspendAllocation s
ĠspendAllocation Id
ack ing
Ġj ob
Que ue
Points Transactions
obile Number
Ġco ver
L ine
M ember
c wd
i sh
p ackage
wait ing
Ġ======== ===
em r
Ġpro to
Ġde livery
Ġresol ves
ĠAd d
constant s
Queue Handler
0 3
h f
o Z
Ġt ext
Ġe ngine
Ġowner Id
Ġĉĉĉĉ čĊ
) ){
L I
(' ..');
On ly
Ġph one
ĠSu ccesfully
" ',
L ice
s ign
Ġ{ },
qu otation
Ġh ospital
asset Info
transaction s
vi ded
Ġngo Key
ĠVot ableItem
ĠGen erate
Prototype Of
J EC
d r
m a
Ġm ax
Ġo ld
ĠC ompany
user Type
Pro posal
Ġvot ers
EC D
e nc
o st
se conds
Ġquery Donation
ac y
Company ID
grad Coins
fir m
ECD SA
2 5
S ale
p atent
in stance
wa s
json Record
Ġbe ing
Get AllAssets
STANT S
P harm
f n
q Msg
st udentId
Ġc up
es lab
al ty
Ġm in
re ceiv
Ġ[ "
ĠS imple
en v
Ġse c
MSP Id
Log ging
ngo Query
Ġngo Query
Le ngth
Sy nc
Que ues
ĠqueryDonor RatingsForNGO
eslab on
! ');
D escription
a ccess
e llo
p late
od y
ab ility
List ing
Ġdoes n
(" ./
Ġmock Engine
upp ly
trans ient
C C
E mit
S chema
Ġ Token
Ġ valAsBytes
or ator
Ġ' -
ult is
yt e
Ġĉĉ ĠĠĠ
car e
con c
ra de
model s
ealth care
obileNumber s
ultis ig
B S
P ay
ĉ čĊ
Ġ 7
Ġ 8
Ġ url
Ġp aid
Ġget Asset
mock Engine
Update d
10 8
. ");
A P
d istributor
Ġ TimeStamp
++ ){
valid ate
TI NG
app ly
Ġvalid ate
candidate ID
Parse d
vest ment
2 000
A ction
C andidate
is c
Ġh ierarchyKey
ĠP harm
Ġitem s
orm al
Ġrew ire
Ġproto col
5 5
F ID
V AL
p ledge
Ġ ss
Ġ getState
Ġ Logger
Ġr aw
ro ll
se nt
Key s
In s
In voice
00 1
order Number
ind ing
Ġ100 0
ĠM SG
Ġadd ing
register ed
Ġfin anceCo
Ġappro ve
a adhar
o ok
er e
Ġp arameters
Ġasset String
asset String
Ġse archKey
ac cepted
cont ainer
Ġro le
' s
1 7
2 3
Ġn etwork
ol es
Ġquery NGO
Qu antity
mat erial
alled BusinessNetwork
Ex iting
invoke Chaincode
ip her
CA TE
Sy mbol
( -
B id
M oney
c m
c age
m ax
o od
w it
Ġ users
St ruct
ol low
ed s
Ġb ank
te mp
Ġĉĉĉĉ ĠĠĠĠ
av ailable
vot e
Ġsell erCRN
Ġorigin al
Ret urn
O perator
R ate
Y DV
a iting
i em
Ġ De
Ġ Helper
ub ECDSA
ul es
Ġcandidate ID
EX IS
16 09
View er
aiting List
1609 5
l ists
er ialize
Ġin c
Ġcreate Asset
Ġcurrent Balance
company CRN
Ġupdated AssetInfo
des erialize
getCurrentUser Id
ĠSimple Chaincode
C urr
R M
] +
c ce
l an
r int
u al
Ġ Name
Ġm spId
Ġget Metadata
Ġvalue Int
ĠP atient
Ġexample Metadata
ĠRe quest
ac ility
Ġapp lication
Ġsub mit
Hold Value
ecut e
0 5
H A
I z
m spid
Ġp romiseOfIterator
unt ime
Ġver ifier
ĠMy Contract
W eigth
w ib
Ġ ],
Ġe ntity
ĠC omp
ĠC omm
Ġf ollow
Ġst udent
ex isting
ent ity
Ġ[ ],
contract Instance
Ġpro p
Met hod
Ġrequest er
Ġreceiv ed
ublish er
exp iredAt
wib ble
I NG
M ON
p oint
r andom
s For
ed Proposal
Ġst atic
Ġper mission
Ġclient Travel
Comm and
shipper Id
Ġinitial ized
P A
S mart
c al
s u
re place
ire ction
Query State
li ver
property Key
Ġcomp ositeKey
!! !!
- *
R untime
T itle
st ination
Ġa ct
Ġt ag
Ġm ark
from Char
Ġst udentId
ĠS e
Ġon ly
my Collection
property Id
Ġtransient Map
ĠNode Utils
EXIS TING
ĠgetMetadata Stub
fromChar Code
4 4
E S
O r
Ġ year
Ġf uncAndParams
tx Queues
pro du
Error Msg
Msg Response
ver age
comp ositeKey
Ġproduct AsBytes
offee AsBytes
Ġretail er
Ġmedic ine
E NO
K oZ
Y I
m ssv
w s
it r
me nd
ur ation
Ġĉ ĠĠĠ
ĠA lloc
Ġin st
ĠRe ference
Ġar r
UG H
igh est
transient Map
Iz j
MON EY
ENO UGH
KoZ Izj
2 4
G A
M edic
S ub
W AR
b ase
Ġ was
st ock
Ġa pproved
Ġo perationId
ch arg
ha sh
Ġad ded
AC K
money Bytes
File Stub
Ġfi sh
Ġservice Proto
Ġpay out
T LS
d escri
d ummy
m spId
de vice
Ġf ail
ord ers
ance l
Log ged
Ġtx n
Ġpurchase Order
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ
Ġaadhar Id
medic ine
COR E
itr ation
3 6
C hain
a son
n um
Ġ ]);
le ng
ing le
In put
tx n
Ġw orld
(" ========
ic om
Lo gist
vi de
Account ID
Us ers
wit ch
descri be
Logist ic
2 6
7 6
B ookmark
V E
f ig
i ch
y Id
Ġres p
ĠĠĠĠĠĠĠĠ ĠčĊ
De posit
Ġcomp oser
election Id
getMetadata Stub
Ġ\' '
W eight
a z
Ġc om
Ġc urrElection
Ġ' \'
get PrototypeOf
ĠA vailable
ai r
Ġ" $
Function ality
aramet er
Ord ers
drug Object
Ġvot able
has OwnProperty
Cont ainer
Ġauthor ized
P olicy
b server
h elper
j A
j ob
w C
Ġ To
Ġ No
se l
lo ok
Ġre gen
erator Runtime
up gradCoins
update dAt
Ġclient Id
ER TI
Ġorgan ization
FI CATE
AsB yte
look up
Ġregen eratorRuntime
ERTI FICATE
T e
y alty
al Record
re con
lo od
th ing
() =>{
data Marshall
User Object
Info FromContract
Ġcont ext
Ġload s
ppro val
E mpty
G re
M T
Z ero
b c
b ank
c ustomer
f und
o w
tx id
Tr ade
Ġget DonationsForNGO
Asset Contract
Ġis Fin
dent ial
Ġun i
Ġrecord Counter
Se arch
product Id
12 34
Ġprocess line
Lice nse
available AmountForDonor
ĠAlloc ating
ĠisFin ite
1 4
5 00
7 75
= '
A Z
I f
i en
r ules
er ID
ĠC lass
log istic
act ivity
Ġre port
Ġs id
Ġasset AsBytes
user Name
user List
Ġde bt
ĠRe vision
ĠD irection
trans porterCRN
Ġload Id
ĠSh im
Ġsource IP
Ġsource Port
Ġdest IP
Ġdest Port
ĠRule Owner
Ġcre ating
ĠClass Type
E n
g in
Ġ Voter
get User
tri m
Pro file
assert AttributeValue
Msg QueueHandler
At trs
Util ity
product ID
Ġl ab
Ġretail erCRN
Ġval ues
C ourse
I B
N U
P L
P RE
b y
d oc
h b
r ate
ar ision
in h
se nd
an itize
get Logger
Ġparse Response
For Comp
con d
ĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠ
new Logger
Ġpro vider
la g
que ue
Ġcurrent ly
Allocation s
20 19
Ġsu cce
GetState Metadata
STA TE
ĠRule Action
su per
Ġdebt or
anitize Args
ForComp arision
) }`);
= "
> ',
A T
A adhar
B ACK
M P
V accine
e ncrypt
s v
st udent
al leng
ĠE lection
get Creator
Ġs witch
ou s
00 2
Buffer Args
contract Name
Ġutil s
Ġuser ID
read File
ĠqueryAll Donations
At tributes
chai AsPromised
Up per
Ġchai AsPromised
MA L
Ġproperty Object
Ġen ergy
offer s
ĠqueryAllSpend Allocations
ĠquerySpendAllocationFor Spend
ĠJ oi
enc ode
-* -*
: [
D B
D istributor
M anufacturer
m isc
t cp
Ġ license
in ated
al ert
Ġĉ Ġ
per son
Ġf low
Ġquery Donations
Ġ(! !
load s
vo ices
te n
ĠĠĠĠĠĠĠĠ ĠĠĠčĊ
Result From
Ġpro posal
De c
RN AL
TE RNAL
ana ger
comm odity
EX TERNAL
ĠMy AssetContract
Ġpag inated
Mark et
DO OR
HO ME
receiv er
Ġ'- >',
WAR E
rules et
BACK DOOR
MAL WARE
ResultFrom Bytes
A llowed
s chemas
Ġ State
et a
at tr
Ġre q
Ġquery RatingsForNGO
Ġquery DonationsForNGO
ge nder
cc Key
Ġget All
Function s
user ID
Ġuser Asset
invoke Functionality
Ġno w
Ġshipment Key
Ġshipment Object
ĠquerySpend ForNGO
Sp lit
ph one
ĠquerySpendAllocationFor Donation
Ġpeer Org
Smart Contract
ĠqueryDonations ForDonor
m atch
m ca
q az
r c
Ġ St
Ġ The
arg et
an ies
() };
set ChaincodeStub
-------- --------
ĠW orm
75 97
ph an
di em
'} ));
98 775
ĠQ AZ
hs q
ĠLog in
Do ctor
ws x
mca fee
qaz wsx
4 9
D ave
L L
L ocation
P lan
Ġ' '
Ġo cc
to Upper
Ġb lock
ou se
parse Int
": {
spend er
Receiv er
Ġproperty Id
seller Data
Client Id
sub mit
cont ent
AN S
Passeng er
ĠSe ller
toUpper Case
! '));
= {
m d
m mend
Ġ 9
Ġ Map
qu ipment
Ġre ce
ed Bytes
Re move
Ġamount Int
Ġcreate dAt
Info Obj
some Fn
Event s
Ġhandle Message
fi Id
request erId
Per Passenger
FI X
CurrentBalance Bytes
dit ion
ciever Balance
V e
] };
d ating
f fil
y c
Ġ Update
at trs
sh a
am ing
Ġ[ ]);
il d
drug List
ĠM ath
Ġrequest ed
fg Date
Aw I
If Empty
" ].
7 7
D igitalAsset
M an
i eld
l ation
r s
Ġ ship
re port
sy stem
Ġs imPublicKey
ĠqueryAll Donor
property Object
Ġproperty Key
ca st
profile Id
Ġlo t
di gest
onth ly
sum ption
Ġ=========== ");
ighest Offer
ĠqueryAllDonor s
> =
C E
E MR
M int
i sed
l ay
t itle
et ing
Ġc lear
Ġcon firm
Ġe xpecting
query By
Ġd es
Ġs mart
Ġto pic
Ġget Logger
00 3
Ġh elper
pro p
'] ];
ĠqueryAll NGO
organ ID
Ġtx ID
fake path
Ġcommodity Id
ĠqueryAllNGO s
, '
A pp
M I
s imPublicKey
y p
Ġ $
Ġ lastName
Ġe p
Ġf ull
Results Parse
Ġget TxID
Ġget Creator
Transfer Request
For e
Ġpro ofit
end Key
ir ation
('# _
init Logging
Ġproduct Id
app ointment
Ġfirst Name
-' +
Ġuuid s
dec imals
Ġwr ite
ultisig TransferRequest
HA IN
A ME
E ND
M obile
P erC
T w
c ore
c lear
s cri
Ġ k
Ġb ill
Asset Owner
Value Id
Ġkey Mod
du ction
SE R
ĠM essage
Se conds
Ġcomp onents
Ġwr ong
PRO JEC
ffil iation
PerC ent
PROJEC T
( ...
- ${
6 4
B rie
P ut
W aitingList
c or
Ġc ash
Ġc hairs
in ternalGetStateByRange
Ġm anufact
reate d
Ġin ternalGetStateByRange
And Send
Ġĉĉĉĉ ĠĠĠ
Current AndSend
Mi ss
Vot ing
Next Msg
ER Y
Ġelection Data
ified By
serial izers
Ġmatch es
ĠTest s
Ġpag esize
Ġcredit or
onthly Fore
Brie f
CurrentAndSend NextMsg
onthlyFore cast
5 8
S T
c ase
æ ķ
Ġ eslabon
Ġp refix
row er
ad o
Re q
la use
De f
Ġpatient ID
Ġseller Data
Ġsy mbol
instance Of
produ c
Ġsucce ed
æķ °
A D
K EY
P aid
] });
f irstName
o Registered
p la
r b
r al
Ġ us
in put
Ġr ule
re move
Ġcolor s
asset Transfer
pro ofit
Init iator
Ġbuy erId
init ion
init ial
Current State
Ġset Level
Ġpo ID
object Type
eng ers
Sender Balance
rie ve
Organ ization
hoc phan
processContract Transactions
htt p
orator y
* ');
D oc
S s
r n
Ġa mt
Ġtr ade
Re con
100 2
Ġtransaction Id
ĠRe gnet
pur chase
ip ient
ĠD N
default To
("======== =====
PRE FIX
yp es
Def inition
C HAIN
M odule
d Payload
Ġ Transaction
in JSON
ate g
fer ral
th er
log s
Ġasset State
Contract Name
CompositeKey For
en ergy
Info inJSON
ĠM anufacturer
product AsBytes
current Owner
iss ing
default ContractName
Ġexp Date
Ġspe c
Sign ingId
Not e
itize n
pre v
readFile Sync
A ct
C ustomer
N ames
P oc
P ER
a k
g lobal
s anitizeArgs
t ing
Ġ String
or se
Ġa uction
get Asset
get ResultFromBytes
Ġp harm
res ident
ed Asset
ex it
orre ction
Ġ======== ');
Ġid Bytes
list OfAssets
lice nce
andid ates
comm on
ĠAd ded
Ġage nt
License Plate
alleng e
Ve hicle
" +
Q U
v ersion
St r
to pic
Ġp oll
ut es
code dPayload
Ġin vestment
asset List
create Logger
data ID
De codedPayload
ĠP lease
Ġpatient s
handle MsgResponse
New ErrorMsg
ĠQuery Assets
Ġq Msg
registration Id
fil es
ĠHelper s
CompositeKeyFor Search
3 00
F ull
] ),
f c
g n
m ore
p a
y ect
z a
Ġc lientIdentity
at s
Ġa c
Ġnew Value
ĠC ON
ĠC ERTIFICATE
Ġre ference
Ġs vinfo
ire Buffer
Int er
return ed
Ġcreate User
Ġfo od
Object Type
bo ok
Pro vided
)) ,
Ġ` ${
ĠSh ipment
Ġup dating
Pend ing
Put State
B e
O ld
V ien
c es
n ormal
v in
Ġ RE
or ed
it ies
Ġp ublicKey
ĠC h
Ġd ocument
Ġi gn
Ġw inston
And Emit
pp ing
ee ded
Ġseller Id
Ġorgan ID
pen s
acc ination
Ġlogistic s
votable Id
AndEmit Result
. ';
3 000
C p
W h
Y W
d ocument
t sSec
ch i
ch ange
mp ort
ou pon
Re flect
Ġit erate
il es
It er
ĉĉ ĉĉ
Ġcall erId
ive n
Ġcomm unity
ĠPro cess
ĠtsSec Value
Ġrew ard
sell erCRN
Miss ing
tsSec Value
C N
I U
O pts
c art
c ash
r l
sync Iterator
ode led
Ġre move
Ġquery WithQueryString
Id s
asset ToTransfer
create d
ir y
99 99
count er
go vOrg
Ġupdated Asset
Ġcheck Number
updated Asset
RO LE
Us ingA
Ġdec rypt
Mat erial
ĠPharm anet
voices Bytes
Ġrece ive
UsingA syncIterator
3 1
E N
O String
S ome
b m
c lass
d escription
e ed
m odule
o perator
Ġ quotation
Ġr ate
re dential
de livery
to IS
Ġcolor edAsset
ord in
Ġin valid
Ġ1 1
li c
read MyAsset
De fault
Ex p
TE R
Log s
fin ish
ĠD ummy
ĠQuery Utils
Ġcourse Id
form ation
roll ment
cond Call
toIS OString
ĠcoloredAsset ResultsIterator
) +
< %=
C itizen
H ospital
W r
` ,
Ġ x
Ġ uid
Ġc ipher
Ġt od
Ġm fgDate
de posit
Ġo perator
ĠC RM
Ġf n
Ġquery Content
De stination
Ġreturned Buyer
}, '
Drug Details
fi eld
Ġmatch PerCent
Parse Response
bt Obj
decode Stub
Ġcup Coffee
! ';
E l
T emp
n Paper
Ġ K
es sel
Ġ' -----
Ġm issing
Ġo pen
Ġp re
Ġp allet
Ġp olicy
Ġe hr
Ġs ingle
Ġb ook
Ġ}, {
Ġdonation Amount
el ta
Arg ument
Ġtrans port
100 00
ĠRe gister
Se lector
Ġhistory Iter
Ġmatch ing
Ġfollow ed
AT TR
ateg ory
E ve
M x
M anager
P acient
S H
T MC
a W
n ers
t ed
u d
v ices
Ġc oin
at ivity
Ġ} ));
(' ,
Ġth an
Ġreturn Obj
Ġp rescription
ĠC redit
Ġin stance
Ġex port
Stub A
om or
ru le
age ment
response Metadata
organ ization
Drug CurrentState
LE D
part icipant
updated AssetInfo
min ter
sec ret
Ġpart y
:: {
Fn StubA
Man agement
" ))
@ @
O peration
T ypes
W ireBuffer
a wr
a jv
d ation
f armer
k ed
p oints
z E
Ġ pe
ar vest
Ġ' ');
Ġt en
Ġĉ ĠĠ
Ġp lace
ĠChaincode Error
Ġchange Car
el ds
Ġal pha
Ch i
ĠAsset Exists
ari o
Ġelection Start
Ġelection End
current Balance
Con fig
Node Utils
CD elta
CHAIN CODE
awr ap
0 4
C c
C lose
F irstName
J ob
L O
R A
U rl
Y C
] [
e arn
g mail
Ġ Iterator
Ġc ode
it u
Ġm ed
re ed
arb itration
ĠB lock
Ġf unc
Owner Id
00 01
owner Name
On Market
Ġorder Number
Ġread y
Ġcompany Key
Request Key
Request ed
Ġg rpc
request er
Per son
ppro ve
Ġapp ointment
FID tag
16095 48
orse ment
R aw
` )
e b
n e
p ayment
p rescription
} /
Ġ Start
at er
ĠB allot
id erId
Ġexpect s
Ġdata Marshall
as ic
sp lice
Ġwith out
balance Key
balance Prefix
Ġcont act
AC TION
Ġorgan ToTransfer
Ġexpected Response
pic ked
Us ing
Ġaadhar Number
Ġcustomer Aadhar
lay er
ĠRegnet Helper
Cc fc
2 1
6 6
E G
P urchase
U SER
c oins
p oll
Ġ li
== "
le x
==== ==
Ġm spid
Ġm ssv
Ġm spID
Ġp arameter
Ġe nc
tr ade
Ġget Args
return AsBytes
Ġthe Module
Ġcreate Shipment
order Status
With out
Pro vider
data Owner
De vice
Ġrecord s
Balance Key
chai rs
Ġallocate d
Ġ100 2
Up dation
Ġcompany ID
Ġrequest erId
Ġclient CarOwner
Ġlog s
ER C
handle Message
buyer Data
ĠassetJSON asBytes
election Data
Ġy ield
Ġsub j
Ġdec imals
bid Price
zzzz zzzz
Updated Balance
liver ed
ĠcurrElection s
cor r
itu de
2 9
L ab
a uthor
d ing
g YI
i se
s upplier
t arget
ä ¸
Ġm ore
ĠE ngine
Ġtr uck
Ġs upply
(" ../
Ġmock Stream
Ġde vice
transaction Id
ach ine
IS TOR
ĠPro file
appro val
processContract Info
ours es
wC gYI
ISTOR Y
0 7
4 7
A p
D iem
S o
Ġ I
on Iterator
in stantiate
Res p
get Time
get Company
tr ader
() ',
Ġst r
Ġ" ",
delete AllResults
Function Name
Ġinit iator
Ġdonation Info
'] ))
spend PerDonation
Balance Val
"} '
my value
split FunctionName
patient s
ĠspendAllocation Record
spendAllocation Record
Le ase
Ġj ason
ĠĠĠĠĠĠĠĠĠĠĠĠ ĠčĊ
price Balance
option s
Pay out
ĠCON STANTS
Without Attrs
A ge
A pproved
I C
V ENT
l ations
m ain
Ġ shipper
Ġt ong
to Loc
ri x
ent ry
===== ');
Ġstart Time
================ ================
ĠP O
Ġunknown Transaction
Ġread Asset
TR ANS
So Chi
B s
E qual
R ight
T X
c N
c ipient
e hr
m obileNumbers
p ag
u ation
u dit
Ġ ){
Ġ Utility
in valid
(' _
se ats
Ġo ption
lo an
ĠB asic
Ġre view
Ġtr ader
Ġs p
parse d
user id
ic ation
Lo an
Ġcc Args
Error f
Invoke Chaincode
vot ableItem
handle QueryState
donor Query
part ner
pass engers
Offer ta
]: *');
mod ifiedBy
toLoc ale
M Q
S U
c oin
f ace
i ang
o v
p ubECDSA
Ġ You
Ġn t
get H
ult y
Ġres ource
ch at
Ġd i
res hold
() {
() }`);
Ġ======== =====');
ĠIn s
Record sCount
ĠS CDelta
create AndEmitResult
av a
Ġvot ing
atur es
ac ulty
Ġbuyer Key
TI ENT
AL SE
ĠqueryAllSpend s
Total Supply
pay able
Ġsec ret
YDV R
ĠDummy Data
deposit Balance
toLocale String
' :'
3 8
A cc
A jv
C tr
L and
N AME
f t
f ind
h ost
h ello
m an
p ace
t in
} ).
Ġ orders
at istic
Ġt reated
ĠE MR
Ġnew Member
Ġreturn ing
Ġp atent
ĠB uyer
By Travel
em per
Ġuser Type
Ġchaincode Name
mock NewErrorMsg
data Viewer
Ġerror Message
Init Spy
Transaction Spy
Get Curr
ngo Key
Company Buffer
Ġbuyer Data
out put
Cont roller
Ġregister Company
Ġexisting Drug
Ġdonor Query
ecut ed
Ġcre ation
InfoFromContract Stub
Full Year
Ġtod ay
tin chi
GetCurr Msg
F ALSE
P arameters
P ublic
i SmartContract
p ublic
p ublisher
u ring
Ġc ancel
Ġm o
Ġret rieve
Ġd uration
ent ryp
Ġstring Arr
chaincode Name
shipment Key
LE TED
Ġfi elds
ĠG ET
uncAndP ar
Passeng ers
ĠComp oser
Ġact ive
Ġocc ured
scri ber
produc erId
Inter face
entryp oint
" ).
B h
Q Q
W N
b lock
h ouse
i ke
r on
u ate
ĠĠĠĠ ĉ
al er
Ġn e
ub Key
get FullYear
Ġo ut
per mission
Ġd m
Ġd oc
ex ecute
Ġget History
Ġget Transient
ĠIn fo
ĠIn voice
create Key
response Tx
Ġat tr
data set
De livery
NG TH
Create d
Part ners
Fi IndexKey
Ġg iven
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠ
ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠĠĠĠĠĠĠĠ
LE NGTH
Client IndexKey
process net
map Cfg
ERROR S
hold Obj
Sign edProposal
Ġaes Ctr
htt ps
waiting List
Ġsec ure
ĠTimeStamp Time
ĠTimeStamp Date
Ġinc ome
Ġapplication Data
iry Date
participant s
Ġjason Content
C lear
I ND
L OG
] ]
f e
å ı
ar r
le n
St ates
re w
get Seconds
Ġp ayment
ĠA S
delete MyAsset
Car Client
create MyAsset
start Date
erC ount
en erCount
Ġuser Object
Ġde leted
Ex ist
Ġun it
Cont act
Ġview DrugCurrentState
CON STANTS
BgNV H
getM onth
appro ve
Ġinvok ed
Ġopts Cp
ĠoptsCp y
9 3
C K
G IS
T U
k ill
p ublicKey
Ġ ;
Ġ Tr
Ġm obileNumbers
Ġd igitalAsset
Ġb ody
ire d
Ġ< %=
Ġĉĉĉ ĠĠĠ
ock i
order List
:' +
uy Van
pt or
balance Of
result AsBytes
Ġview History
Ġsub ject
Ġq ty
land s
are a
conc at
Allowed User
pag esize
emper ature
! `);
" },
. "
F act
H R
I nd
S I
i ep
l f
v ert
Ġa uth
Ġm ain
Ġs er
Ġasset C
ic k
Ġdelete Asset
User Key
status Code
Get QueryResultForQueryString
Ġbatch Vaccine
ER T
Ġcomp leted
Suppli er
buffer To
hold er
30 3
30 4
VAL ID
Mobile number
arvest Batch
3 02
A ss
B uy
Q Msg
R ule
e ngine
j b
o vOrg
} -${
== '
Ġc offeeAsBytes
in utes
Ġa llow
(' '));
Ġm ultisigTransferRequest
Ġf etch
Ġre ferral
Ġs im
un i
Class es
new C
urre ncy
Data Collection
Ġmock Context
some Key
ĠP er
Event Service
company Name
Request s
Trans port
current Weigth
batch Coffee
Ġĉĉĉĉĉ čĊ
Co ordin
Ġfi eld
Ġwallet BS
totalSupply Key
totalSupply Bytes
Ġaadhar No
retail erCRN
Ġsell Order
ĠtotalSupply Bytes
getM spID
PointsTransactions Key
ĠToken ERC
:[ ]});
AssetOwner ship
Ġspec ified
getResultFromBytes Stub
ĠchangeCar owner
6 7
B inding
D ocument
c rypto
g ht
n ames
t c
er point
(' ',
Ġr ating
re gistrar
get Date
tx Helper
Transfer From
Val ues
ers ity
Ġh ms
ap per
Ġpro d
Ġde n
Ġde p
iv ersity
([ {
ĠP ayment
add r
comm and
Ġy md
Ġlo an
COR D
Ġuni que
En rollment
purchase Order
pens ation
Wr apper
Ġli mit
2 7
A TION
A ffiliation
B ill
B ank
B UG
F lag
O U
S im
S cript
b i
b ody
k ta
n otar
p allet
y m
å Ī
Ġr ight
get BufferArgs
lo op
fo o
JSON asBytes
Ġre ferred
Ġowner CarClient
Re ce
By User
Comp onent
contract AsJson
Ġpro g
DE BUG
ask et
Assets ByRange
Ġpatient FirstName
aid Org
grad uate
dec rypt
sum er
LI ENT
Ġreq Json
ava Script
3 01
H ello
I g
P AR
f uncAndParams
ĠE vent
Ġre st
Ġre lation
Ġget AssetsFromBatch
ent ication
ab normal
up g
pro posal
Ġcreate AssetsFromBatch
set State
Ġinit Money
format String
Pro duction
Ġbuy Order
init Money
throw Error
Request List
ĉĉ čĊ
Private Asset
Ġtoken s
fi sh
Ġelection s
prov ers
Ġl ine
Ġent er
Ġcreated Time
des ign
gh iep
Project s
her lands
Ġle ave
Ġformat String
Mat rix
queryBy ObjectType
ĠCh eck
EG IN
E lement
M L
T T
t or
(' @
ing s
lo ye
fo od
tr a
tr uck
res p
ed H
tx Id
Ġasset Json
key To
Ġw ill
Ġ2 50
age nt
Th an
called Tw
spend erId
Ġse lf
Sh im
The Issuer
shipment Object
Ġcompany Object
company List
Ġg rade
Ġlog ged
Ġcall er
ĠD o
process line
sub string
deb tor
retail erId
View ers
fir med
getCurrentUser Type
credit or
Pend ingA
calledTw ice
A c
C LIENT
E w
E AwI
G iang
J avaScript
L A
P K
P en
Q YDV
\ .
a uction
c T
d is
e arch
h an
l Case
r an
w H
Ġ Donor
at tributes
nt ime
get All
get BalanceOf
ame lCase
ut ion
Ġf armer
Ġd on
Ġd istributor
Ġquery Selector
from JSON
ge x
util ity
ty es
Ġĉĉĉ Ġ
ru ntime
OR G
Ex F
Ġorder ID
.. ");
Ġread State
file name
Ġshipment ID
Ġcomp osite
ĠGet AssetsByRange
expected Response
Ġy et
Ġsh ow
AsB tyes
Ship per
BgNVBA o
PA TIENT
ĠpurchaseOrder Object
cN MT
ĠassetC amelCase
QYDV QQ
2 34
C T
D id
P as
c offeeAsBytes
d a
e cho
h ocki
p romiseOfIterator
r ame
w eight
y b
Ġ la
Ġ queue
); }
ĠĠĠĠĠĠĠ ĉ
Ġc b
Ġ' ]
Ġe arn
is Gre
ĠA ccess
ri p
ge ncy
ĠJSON Serializer
Qu otation
ay s
Asset Name
pend ing
By Deposit
Ġw ord
create Engine
CompositeKey ID
ĠĠĠĠĠĠĠĠ ĠĠĠĠĠĠčĊ
new Voter
ready Msg
Ġresult Iterator
SE T
Ġreturned AssetName
Current Time
Drug CompositeKeyForSearch
Ġread FileStub
ĠM ock
vot ing
property ID
property List
getCurrent Msg
Shi pping
anufact ured
Un able
ra nt
ĠR etailer
inst alledBusinessNetwork
fil ter
Ġpart icipant
financeCo Data
Num Passengers
flect Stub
pay out
Ġparsed Item
Ġfake Error
Ġfake Success
ide o
Ġ7 00
Ġraw material
registered Msg
Curr Stub
send Msg
App lication
pla za
handleMsgResponse Spy
ĠqueryContent By
(', ');
ater Than
Ġsp lit
isGre aterThan
isGreaterThan Zero
4 0
B EGIN
C redit
L y
M atch
N et
R oles
Z X
l at
o y
p olicy
s Data
t map
} ]
Ġ last
Ġ Organ
Ġ licence
or ation
or age
or rower
Ġa m
Ġ' ./
ĠE x
Ġreturn AsBytes
query Results
Ġf loat
Ġh ighestOffer
Car d
ic al
Ġissuer Id
Ġinteger t
'] )
Ġfrom Wallet
Ġ_ _
Ġno thing
Serial Number
Le ave
Ġcount er
Payment s
hospital Id
Ġ8 00
cage Id
Ġus ing
Ġpharm acy
lations Array
Giang Vien
! ");
G l
c up
g c
i mpl
o g
Ġ ********
Ġa id
it ion
let ion
Ġcon dition
re view
pe c
String Args
to s
Ġp ublish
Ġp ledge
ĠC ertificate
res ource
Ġs uppli
Ġs rc
ID s
key Mod
Ġ" "){
ĠS CAlpha
()) {
Ġdata Parsed
:' ',
Pro ofit
Ġmetadata ToSend
vi ous
Ġdrug History
Property Object
Test s
Ġclient Logged
Ġbuyer Balance
11 11
current State
current Loc
sub str
Ġload Found
Sy stem
Ġpo Key
require d
Ġmin ter
Return ing
case Name
ĠBlock ly
Rece i
Ġrest oration
Ġrelation ResultsIterator
: ${
= [
A mmend
C hairs
J V
O P
c o
j B
m age
r ary
u int
| \.
on Se
val uation
re g
Ġp late
ha ar
Ġasset Pas
Re view
create Sandbox
Ġuser Buffer
data Service
DE R
Ġsuccess ful
Ro ot
Ġclient Data
(_ _
request ed
Shipment Object
ci et
Account Balance
Ġprofile Old
Ġcandidate ToTransfer
serial izer
Ġy our
ĠH as
getM inutes
Ġ6 00
Pharm a
cal Case
Zero IfEmpty
IB U
defaultTo ZeroIfEmpty
QU ERY
Right s
getH ours
Ġlogged Client
Net herlands
|\. \
onSe condCall
ĠassetPas calCase
A pproval
G ET
O TA
S or
d ir
m odeled
n Content
p ar
Ġ gender
es e
Ġa ctor
Ġe qual
In stantiated
log AsBytes
Ġd iem
ri v
Re gistrar
Tr acking
Ġex ecute
create Hash
Ġpro vided
Ġat tribute
js nContent
"} ));
Ġproduct Key
Ġg ovOrg
Ġ{" $
Token Name
Ġload ing
PE ER
Comm ons
End orsement
Ġput State
decode d
ĠAdd ing
aadhar No
ĠComm onIterator
Ġtxn ID
vide nd
1234 56
reed om
wCgYI KoZIzj
TRANS ACTION
votableItem s
Ġauth entication
newC oll
PendingA pproval
letion Date
Sor ry
1 50
C om
G ING
J u
N hb
P re
\ ":
d raw
f irst
k w
l ai
m ary
s vinfo
Ġ qual
Ġ DE
Ġ StateQueryIterator
at al
let ter
val ues
re que
Ġreturn Value
Ġp os
Ġe al
Ġre g
Ġinit iate
update MyAsset
Ġjson Data
Ġdrug Buffer
Ġdrug Details
Ġclient ID
Ġseller Key
Ġbalance Key
Sp ain
cert WithoutAttrs
ĠH ISTORY
Ġuse d
Ġprivate Value
Ġauthor ised
upply chain
charg e
Ġcom pensation
commodity Id
ĠProcess Line
ĠPharmanet Helper
ĠPayment Recon
earch er
reque ncy
3 5
3 7
B ook
I T
O T
a ded
b ill
e quipment
f ine
f aculty
i ct
j a
r DecodedPayload
Ġc btObj
Ġ{ '
le m
an cial
Ġp res
Ġp ublisher
ist ure
query Marbles
ed MSPID
Re cieverBalance
Ġto CurrentBalance
Ġget User
For Updation
user Buffer
user Object
Ġhold AuthValue
#### #
Ġtransfer Event
red s
Ġdescri ptor
Ġmock Event
Ġdelete Cars
mark s
Tx ContextId
Ġcurrent Allowance
Met erpoint
Ġorder Key
Ġorder erId
Init ial
Ġdrug Obj
ĠcurrentOwner s
donation Data
Ġdecode Stub
transfer Event
balance Bytes
ĠRe gistrar
count ry
check Length
handle InitSpy
handle TransactionSpy
current Allowance
Ġbalance Bytes
updated Balance
Ġprofile Id
Ġsy stem
ĠbuyerCRN Found
allowance Key
cp List
buyerCRN ResponseRange
Ġproject AsBytes
item s
Ġmsg Sender
Ġgenerate Transporter
Load s
ChaincodeMessage Handler
established Msg
Emit ter
16095 50
Ġinc orrect
ĠcurrentBalance Bytes
Ġsubmit edMSPID
charg es
Logistic Unit
queue Msg
Remove CurrentAndSendNextMsg
initial ise
currentOwner s
Ġcipher Text
DrugDetails ForUpdation
currentBalance Bytes
Ġmo isture
ĠPer son
ĠmockEvent Emitter
2 00
9 6
C B
C oin
I dent
L P
U ID
X Bs
Z S
h hb
i o
p acient
al ized
Ġ( _
so urce
Ġret ry
get Drug
Ġe st
tr acking
ĠA ll
Ġquery Poc
error s
Ġi p
car Model
Ġ[ {
ĠS uccess
To Root
Ġpro yect
Data Service
ser v
sp i
Drug Object
0000 0000
Ġrequest Object
Ġg rad
Ġexpected Product
com ing
Ġins ufficient
Con sumption
ĠĠĉĉ čĊ
Ġproject ID
+' -'+
medic al
ns ion
gest ed
Ġinvok ing
Ġmod ified
Chain X
input s
redential s
lic it
Ġpe m
ĠStart Command
lex ity
uring Date
IND EX
loye e
ZX hhb
XBs ZS
ZXhhb XBsZS
1 02
C annot
I TY
L et
L ink
P lace
U N
U sed
W ork
b lood
g rade
i shed
r am
t ong
u k
u ard
Ĥ æķ°
al es
Ġ' [
ss n
re at
', ()=>{
Ġp romise
json Data
Ġd is
Ġre cipient
ce nt
Ġin formation
Ġget ChannelID
car LicensePlate
key ValueId
Ġ" -
({ "
Ġthe m
Ġcreate PO
set Re
red ict
Ġdata AsBytes
bo i
Ġuser Obj
empty List
ag ing
ĠP H
Ġupdate Shipment
shipment List
comp Key
ob server
ifi erId
Ġpatient AsBytes
Ġpatient Id
patient AsBytes
ĠR FIDtag
__(' _
state ment
Comm odity
wallet OwnerId
getCall erId
Ġmedic alRecord
ballot Id
:: /
inc ome
cho boi
course Id
origin al
Ġcage AsBytes
AP I
VAL UE
mport er
åı Ĥæķ°
0 6
H oc
M ode
O ut
P han
R L
U S
] }
c w
f ab
g ra
i et
l in
p b
Ġ V
Ġ Type
Ġ Up
Ġ Wallet
er ve
== ');
Ġ' ')
Ġ' ]:
St ock
arg ument
an ger
Ġp lease
ad ers
Ġquery AsBytes
ation Id
Ġb lood
Tr ust
Ġget InfoFromContractStub
ĠChaincode Interface
new Plate
Ġkey ValueId
next Plate
Ġmock ChaincodeImpl
Ġuser Input
data AsBytes
Ġcurrent Time
ĠgetAllResults UsingAsyncIterator
RE D
Ġper form
Transaction Id
Part ner
Ġvot ingId
Drug s
ign ation
check List
our C
Company Key
Ġby pass
Ġcont ainer
Ġlist Of
part y
Travel PerPassenger
New User
ĠH ospital
mission s
Ġsender Balance
Hold er
ĠSh ip
are house
Ġfake Ccfc
!!! ");
Ġmax Weight
temp late
NU M
submit Tx
LOG GING
=[ ];
Ġplate AsBytes
lai m
Hoc Phan
nextPlate Id
0 8
4 3
> >
B lock
C urrency
H id
